{"workshopId":2065946296,"Title":"WM Extended Mutations","Description":"This mod aims to add some more choices to the Mutation list! Most of these mutations will be geared towards more role-play orientated players. \r\n\r\n[b][This is the beta release, note the beta is constantly changing so this is more prone to bugs, but features newer additions than the stable release may have.][/b]\r\n\r\n[h1]Description: [/h1]\r\n\r\nThought it would be great to add some more mutations to choose from in the game—at the moment, their aren't as many as I would like in this mod, but I intend to continue expanding it over time, adding more mutations to the list as the mod grows. These Mutations will affect both the players and the mutation list npc's grab when they are generated. \r\n\r\n[h1]Physical Mutations:[/h1]\r\n[list]\r\n[*][b]Chitinous Skin – v1.2 – :[/b]\r\n[*][b]Serpentine Form – v1.2– [/b]\r\n[*][b]Rough Scales – v1.1– [/b]\r\n[*][b]Gelatinous Form (Poison) – v.1.0[/b]\r\n[*][b]Gelatinous Form (Acid) – v.1.3[/b]\r\n[*][b]Thick Tail – v.1.0-[/b]\r\n[*][b]Ovipositor – v.1.1-[/b]\r\n[*][b]Immunocompromised – v.1.1 [/b]\r\n[*][b]Acidic Blood – v.1.1-[/b]\r\n\r\n[/list]\r\n[h1]Mental Mutations:[/h1]\r\n[list]\r\n[*][b]Psybrachiomancy – v.1.1 [/b]\r\n[*][b]Combustion Beam – v.1.2 [/b]\r\n[*][b]Mind Eater – v.1.1 – [/b]\r\n[/list]\r\n\r\n[h1]Metaphysical Mutations[/h1]\r\n[list]\r\n[*][b]Nine-Lives Paradox – v.1.0 – [/b]\r\n[*][b]Incorporeal Form – v.1.0 [Experimental] [/b]\r\n\r\n[h1]Hybrid Mutations[/h1]\r\n[*][b]Ancestral Scionasia – v.1.0[/b]\r\n[*][b]Psychoplethoric Deterioration – v.1.0[/b]\r\n\r\n[h1]Upcoming Mutations and Changes:[/h1]\r\n[list]\r\n\t\r\n[/list]\t\r\n\r\n[h1]Bug Support and Ideas:[/h1]\r\nIf you have any ideas for mutations you would like to see, or modifications to ones existing in this mod, go ahead and give a me message on the Caves of Qud Official Discord or comment here. For bug support as well—you can either reach me on Discord or send me messages here. This mod shouldn't have too many issues with already existing ones. \r\n\t\r\n[h1]Big Thanks:[/h1]\r\nMore like Gigantic Thanks to Armithaig, Lampreys-For-Days, Gnarf, Icecubegame, helado, Exsang and any others I might forgot for not only teaching me the way of C# Coding, but helping me with all the crazy nonsense of learning this code haha, seriously this mod would exist without their help so be sure to give them some love if you see any of their mods and stuff out there!\r\n","Tags":"wm, extended, mutations, add, more","Visibility":"2","ImagePath":"preview.png"}